## Pandas 332 List

In [2]:
import pandas as pd
import numpy as np

### 176. Second Highest Salary [M]

Write a solution to find the second highest distinct salary from the Employee table.

If there is no second highest salary, return null (return None in Pandas).

In [5]:
data = [[1, 100], [2, 200], [3, 300]]
data = [[1, 100], [2, 200]]

employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

employee

   id  salary
0   1     100
1   2     200

In [25]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    top2 = employee['salary'].drop_duplicates().nlargest(2).sort_values(ascending=False).reset_index(drop=True)
    val = top2[1] if len(top2) >= 2 else None
    return pd.DataFrame({'SecondHighestSalary': [val]})

In [26]:
second_highest_salary(employee)

   SecondHighestSalary
0                  100

### 1757. Recyclable and Low Fat Products [E]

Write a solution to find the ids of products that are both low fat and recyclable.

Return the result table in any order.

In [29]:
data = [['0', 'Y', 'N'], ['1', 'Y', 'Y'], ['2', 'N', 'Y'], ['3', 'Y', 'Y'], ['4', 'N', 'N']]
products = pd.DataFrame(data, columns=['product_id', 'low_fats', 'recyclable']).astype({'product_id':'int64', 'low_fats':'category', 'recyclable':'category'})
products

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [34]:
def find_products(products: pd.DataFrame) -> pd.DataFrame:
    return products.loc[ (products['low_fats']=='Y') & (products['recyclable']=='Y') , :][['product_id']]

In [35]:
find_products(products)

   product_id
1           1
3           3

### 175. Combine Two Tables [E]

Write a solution to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

In [36]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [37]:
person

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [38]:
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [41]:
def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    df = pd.merge(person, address, how='left', on='personId')[['firstName','lastName','city','state']]

    return df

In [42]:
combine_two_tables(person, address)

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York

### 181. Employees Earning More Than Their Managers [E]

Write a solution to find the employees who earn more than their managers.

Return the result table in any order.

In [43]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

In [44]:
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [71]:
def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    df = pd.merge(employee, employee, how='left', left_on='managerId', right_on='id')
    df = df.loc[ df['salary_x'] > df['salary_y'], ['name_x']]
    df.columns = ['Employee']
    return df

In [72]:
find_employees(employee)

  Employee
0      Joe

### 570. Managers with at Least 5 Direct Reports [M]

Write a solution to find managers with at least five direct reports.

Return the result table in any order.

In [73]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [74]:
employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

In [ ]:
def find_managers(employee: pd.DataFrame) -> pd.DataFrame:
    df = employee.groupby(['managerId'], as_index=False).agg(count=('id','count'))
    df = df.loc[ df['count']>= 5]
    df = pd.merge(df, employee, how='inner', left_on='managerId', right_on='id')[['name']]
    # if df.shape[0] == 0:
    #     return pd.DataFrame(columns=['name'])
    return df

In [95]:
find_managers(employee)

   name
0  John

### 197. Rising Temperature [E]

Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.

In [104]:
data = [[1, '2015-01-01', 10], [2, '2015-01-02', 25], [3, '2015-01-03', 20], [4, '2015-01-04', 30]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})

In [105]:
weather

   id recordDate  temperature
0   1 2015-01-01           10
1   2 2015-01-02           25
2   3 2015-01-03           20
3   4 2015-01-04           30

In [118]:
def rising_temperature(weather: pd.DataFrame) -> pd.DataFrame:
    df = weather.copy()
    df['recordDate'] = pd.to_datetime(df['recordDate'])

    df_1 = df.copy()
    df_1['recordDate'] = df['recordDate'] + pd.Timedelta(days=1)

    dfr = pd.merge(df, df_1, how='left', left_on=['recordDate'], right_on=['recordDate'])
    dfr = dfr[ dfr['temperature_x'] > dfr['temperature_y'] ][['id_x']]
    dfr.columns = ['id']

    return dfr

In [119]:
rising_temperature(weather)

   id
1   2
3   4

### 177. Nth Highest Salary [M]

Write a solution to find the nth highest distinct salary from the Employee table. If there are less than n distinct salaries, return null.

In [120]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['Id', 'Salary']).astype({'Id':'Int64', 'Salary':'Int64'})

In [121]:
employee

   Id  Salary
0   1     100
1   2     200
2   3     300

In [ ]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    colstr = f'getNthHighestSalary({N})'

    df = employee['Salary'].drop_duplicates().sort_values(ascending=False)
    if (df.shape[0] < N) or (N<1):
        return pd.DataFrame([None],columns=[colstr])

    val = df.head(N).tail(1).reset_index(drop=True)[0]


    df = pd.DataFrame([val], columns=[colstr])
    
    return df

In [197]:
nth_highest_salary(employee, 2)

   getNthHighestSalary(2)
0                     200